{"kind":"dev","methods":{"addholder(address,uint256,uint256,bool,bool)":{"details":"This amount was obtained by running a batch call to the pancake swap router, simulating the token sell with the above parameters. The list was spot checked to ensure accuracy.","params":{"holder":"The wallet address of the holder","snapshotAmountOutBNB_":"The exact amount of BNB the holder would receive if the following were all true: - Holder is excluded from paying the 8% NSM transaction fee. - 0% slippage. - 0 gas cost on transaction. - Sold 100% of their tokens on the snapshot block. - holder's transaction was the blocks only NSM transaction","snapshotBalance_":"The NSM token balance of the holder at the snapshot block;"}},"adminTokenWithdrawal_OICM(address,uint256,address)":{"params":{"amount":"the amount to withdraw","to":"the reciever of the withdrawn tokens","token":"the token to withdraw"},"returns":{"_0":"true if successful"}},"setAddresses_OICM(address,address,address,address,address)":{"details":"External Public function callable by onlyIceCreamMan","params":{"creamery":"The address of the Creamery, the receiver of native coin after the swap has completed.       ","flv":"The address of the flv contract which we are migrating TO","nsm":"The address of the NSM contract which we are migrating FROM"}},"set_OICM(uint16,uint256)":{"details":"External Public function callable by onlyIceCreamMan","params":{"flvPerNativeCoin_":"The rate for calculating claimed tokens. Input the value as a whole number. The decimals are removed later. So for 1,000,000 enter 1000000. The output value of the number when checked with the 'getInfo'  function will show the 9 decimals removed 1000000000000000 example: 1_000_000 ===> 1 BNB = 1,000,000 flv","maxBatchLength_":"The MAX number of snapshot entries allowed per upload."}},"useTokensInContract_OICM(bool)":{"params":{"useTokensInContract_":"set to true and the presale contract will fund the claims from tokens in this contract. they must be deposited prior. Set to false and the tokens will be minted direct from the main token contract"}}},"version":1}
